trade_exp/src/Documents/АктОРасхожденияхПослеПеремещения/АктОРасхожденияхПослеПеремещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="af172ffa-c1ad-407a-8f45-6f3200265096">
  <name>АктОРасхожденияхПослеПеремещения</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузкеПоНакладным</registerRecords>
  <attributes extendedConfigurationObject="cb8fe983-3a0e-4691-8821-32135f680678">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ceef33fc-b037-4778-9a56-8d3c33a93e19">
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cbff09d2-d529-4720-93aa-be510323dfaa">
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb1ddde6-eb79-482e-a410-70887847ccd8">
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0722bc40-03c3-4ee3-a0f1-c8c6cca637f1">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d922f5ac-9f0b-405a-82e3-7625cc3601c7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2f0fe03a-a1b4-4897-a40c-3738f0ccaa56">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="82a5f355-8fd0-4e9a-99f9-8c795e7f5dd1">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="784736c7-90b5-4b41-a6d7-39b8a2615247">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3e2399d1-a2c2-4854-a4ca-7c055c972505">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="272e1fa8-9def-4676-9019-363b879755ce">
    <name>ДатаОтработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee497b1-1e0c-43d3-a7e9-08e21f7d0d40">
    <name>ОтработанБезРазбора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="61efd39e-3811-4df9-b25b-3ed902d3cee8">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e142c880-ca4a-404d-b1a4-0fe89b95bff1">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="317d4103-73cd-4b74-bad6-6ac08c5a26f0">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ea2bc250-1bf2-447c-8afa-679066440e9d">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d286f92f-0066-4cbc-b43f-84d1a4d7fd09">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7af13f0e-7d2a-43bc-b50b-0433b43d6163">
      <name>ТекстовоеОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="113d2cdf-223f-4192-bf21-d0cacbd5aa72">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a1ed03f5-f17a-4125-a3ee-5f56a2e5e6ec">
      <name>КомментарийПолучателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a6ac9f5-56e0-4bf8-9bac-221813ee501a">
      <name>КоличествоУпаковокПоДокументу</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3c6c3875-f18a-420e-851b-89061eb15401">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ac39d370-cfc5-401b-ac2f-980d8c279870">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="af318b4b-f6a5-4f8c-bfde-7be909b884ea">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="51890e5d-f996-4d59-bc4d-cb73a9a8b530">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5cd725a5-130d-4fb3-a73a-f36ecaaf186b">
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="822464c2-4343-473e-9cf7-aa599f3d0518">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="904a4b94-7fd0-447b-ad4b-7e1b00c166ad">
      <name>КомментарийМенеджера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5030b6ce-807d-4502-9efc-fd685b1ae3df">
      <name>СуммаРасхождений</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cbaa155e-3e7c-4a5d-a9f7-f95c093cc07e">
      <name>НазначениеОтправителя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатурыПоставщиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b32fa380-1610-4fb8-bfc7-02c958ebe249">
    <name>ВидЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ТоварыДругогоКачества/ТоварыДругогоКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3b2efd34-127e-4a07-89bd-a94f6887d402">
  <name>ТоварыДругогоКачества</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="86dfdd03-1d54-4567-a1fb-aec3906fe457">
    <name>ГрадацияКачества</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="a82d1df6-c7b2-47f5-ade7-e61a5c7e16d6">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="06502c53-1382-4778-83ab-f65542e3581b">
    <name>НоменклатураБрак</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыАктаОРасхождениях/СтатусыАктаОРасхождениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыАктаОРасхождениях</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Согласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеСогласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Претензия</name>
  </enumValues>
  <enumValues>
    <name>Отработано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыДействийПоРасхождениямВАктеПослеОтгрузки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cd5cf2-becc-47fc-acc1-3f5e388de5cc">
    <name>ПокупкаПерепоставленного</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="017e9b68-db4c-46f6-88bb-302b1d077101">
    <name>ДопоставкаНеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0192c7a0-d8f4-421f-84c3-0422e7c325bf">
    <name>ПерепоставленноеДарится</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="47556336-3f8c-4d55-9a13-9637c157cae2">
    <name>ТребуетсяДопоставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7be36844-c452-4b1b-b08c-6918502de0d0">
    <name>ОтгрузитьСейчас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f22e447b-d61a-47cc-88c8-6ee796c1e050">
    <name>НедостачаНеПризнана</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1b2d946d-c9f5-4037-8399-87421b020da2">
    <name>ВозвратПерепоставленного</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f534a5d7-38e3-40b1-a5a3-1b2ebd98de08">
    <name>ОприходоватьСейчас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec36221d-37a4-4c12-9c34-7cb1eceaead1">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РаспределениеЗапасовДвижения</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes extendedConfigurationObject="bcd3b202-1b4b-4cb7-9c80-2a93e9f648db">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8173986d-73df-48fa-9cc8-38cfe45d8748">
    <name>БлокировкаОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f9d0fad-e42e-4731-8107-06e3f90b212d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="441ea6d9-ec19-4570-b97b-f8e66ebbde99">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8671922f-e1fb-486a-bbb5-fd960e199e94">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="250a0493-3164-44eb-9b46-4baeac4f1c2c">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c23c42b8-9959-4ace-91a6-5a7cbc2fbb63">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a9f05fa3-fa19-43ed-95dd-01e6677ecdf1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d8f9f1e5-d2cd-4da7-ad72-aefa73478085">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89a7e0a8-ebb3-4118-ac5f-b614e1a2fac3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42ebd587-1a10-4279-b4c1-ce101094cfa4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a7742230-e6be-4988-9a70-2b9318d2e6e8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Catalogs/ГруппыДоступа/ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d0106f3a-8490-4277-a278-75c318ec252c">
  <name>ГруппыДоступа</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="0132e564-2cd3-4930-8962-1068532f4be4">
    <name>Пользователи</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="57d0f9b0-18d0-48ba-9f3c-d106f66ac602">
      <name>Пользователь</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Documents/АктОРасхожденияхПослеПеремещения/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.ИсключитьИзКонтроля.Доступность= РольДоступна("РазрешитьИсключатьДокументыИзКонтроляОрдерногоУчета");
	Элементы.ОтработанБезРазбора.Доступность= ЯвляетсяРуководителемОтделаКачества() ИЛИ РольДоступна("ПолныеПрава");
	
	Если Объект.Статус = Перечисления.СтатусыАктаОРасхождениях.Отработано и Объект.Проведен Тогда
		Если  АльтерраОбщегоНазначения._РольДоступна("ПравкаОтработанныхАктов") ИЛИ РольДоступна("ПолныеПрава") Тогда
			ЭЛементы.ГруппаСтраницы.ТолькоПросмотр = Истина;
			Элементы.ГруппаТоварыЗаполнить.Доступность = Ложь;
			Элементы.ТоварыРазбитьСтроку.Доступность = Ложь;
			Элементы.ТоварыУказатьСерии.Доступность = Ложь;
			Элементы.ТоварыИзменитьДействие.Доступность = Ложь;
			Элементы.ТоварыДействие.Доступность = Ложь;
			Элементы.ТоварыЕстьКомментарийМенеджера.Доступность = Ложь;
			Элементы.ТоварыЕстьКомментарийПолучателя.Доступность = Ложь;
			Элементы.ОтработанБезРазбора.Доступность= ЯвляетсяРуководителемОтделаКачества() ИЛИ РольДоступна("ПолныеПрава");
		Иначе
			ЭтаФорма.ТолькоПросмотр = Истина;
			Элементы.ТоварыДействие.Доступность = Ложь;
			Элементы.ТоварыЕстьКомментарийМенеджера.Доступность = Ложь;
			Элементы.ТоварыЕстьКомментарийПолучателя.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	РассчитатьУбыток();
	
КонецПроцедуры

&После("ПриЧтенииСозданииНаСервере")
&НаСервере
Процедура Док_ПриЧтенииСозданииНаСервере()
	УстановитьДоступностьПересчета();
КонецПроцедуры

&НаКлиенте
Процедура Док_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Если Не ПараметрыЗаписи.Свойство("ВопросЗадан") И СтатусОтработано() И НЕ Объект.ОтработанБезРазбора Тогда
       Отказ = Истина;
       Оповещение = Новый ОписаниеОповещения("ОтработкаБезРазбораЗавершение", ЭтаФорма, ПараметрыЗаписи);
       ТекстВопроса = "Акт отработан без разбора?";
       ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПолучитьПредыдущиеРасхождения();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОповеститьМенеджераОРасхождениях();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтработкаБезРазбораЗавершение(Результат, ПараметрыЗаписи) экспорт 
	ПараметрыЗаписи.Вставить("ВопросЗадан", Истина);
	Объект.ОтработанБезРазбора = Результат = КодВозвратаДиалога.Да;
	Записать(ПараметрыЗаписи);
	Если ПараметрыЗаписи.Свойство("Закрыть") Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти

#Область СозданиеБлокировки

&НаКлиенте
Процедура Док__СоздатьБлокировкуПосле(Команда)
	Док__СоздатьБлокировкуПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура Док__СоздатьБлокировкуПослеНаСервере()
	
	СоздатьДокумент = Ложь;

	Док = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Разблокировано;
	Док.Склад = Объект.СкладОтправитель;
	Док.Ответственный = Пользователи.ТекущийПользователь();
   	Док.Комментарий = "Автоматически создан документ разблокировки на основании акта о расхождениях после перемещения №: "+Объект.Номер;
	
	Для Каждого Товар Из Объект.Товары Цикл
		Если Товар.КоличествоУпаковокРасхождения <> 0 И
			Товар.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ОформитьРазблокировав Тогда
		НоваяСтрока = Док.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);
		НоваяСтрока.Количество = ?(Товар.КоличествоУпаковокРасхождения < 0, (-1) * Товар.КоличествоУпаковокРасхождения, Товар.КоличествоУпаковокРасхождения);
		СоздатьДокумент = Истина;
		КонецЕсли;
	КонецЦикла;
	
	
	Если СоздатьДокумент Тогда
		Док.Записать(РежимЗаписиДокумента.Запись);
		
		АльтерраОбщегоНазначения.СообщитьПользователю(Док.Ссылка, "Создана разблокировка товара: " + Док.Ссылка);
	Иначе
		АльтерраОбщегоНазначения.СообщитьПользователю(, "Создание документа невозможно - не найдены строки, в которых есть указанный вид действия и есть расхождения!");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПересчетТранспортныхРасходов

&НаКлиенте
Процедура Док_ПересчитатьТранспортныеРасходыВместо(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Сообщить("Необходимо записать документ");
	ИначеЕсли Не Объект.Проведен Тогда
		Сообщить("Необходимо провести документ");
	Иначе
		ПересчитатьТранспортныеРасходы();	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьТранспортныеРасходы()
	
	Запрос = Новый Запрос (
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктОРасхожденияхТовары.ДокументОснование Как ПеремещениеСсылка
	|ПОМЕСТИТЬ
	|	втПеремещения
	|ИЗ 
	|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК АктОРасхожденияхТовары
	|СОЕДИНЕНИЕ	
	|	Документ.АктОРасхожденияхПослеПеремещения КАК АктОРасхождениях
	|ПО
	|	АктОРасхожденияхТовары.Ссылка = АктОРасхождениях.Ссылка
	|	И АктОРасхождениях.Проведен
	|	И Не АктОРасхождениях.ПометкаУдаления
	|ГДЕ
	|	АктОРасхождениях.Ссылка = &АктСсылка
	|	И НЕ (АктОРасхожденияхТовары.ДокументОснование = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)) 
	|;	
	|	
	|///////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказНаДоставку.Ссылка Как ЗаказНаДоставкуСсылка
	|ПОМЕСТИТЬ
	|	втЗаказыНаДоставку
	|ИЗ 
	|	Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуОснования
	|СОЕДИНЕНИЕ	
	|	Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставку
	|	ПО
	|		ЗаказНаДоставкуОснования.Ссылка = ЗаказНаДоставку.Ссылка
	|		И ЗаказНаДоставкуОснования.Документ ССЫЛКА Документ.ПеремещениеТоваров
	|		И ЗаказНаДоставку.Проведен
	|		И Не ЗаказНаДоставку.ПометкаУдаления
	|СОЕДИНЕНИЕ
	|	втПеремещения 
	|	ПО 
	|		ЗаказНаДоставкуОснования.Документ ССЫЛКА Документ.ПеремещениеТоваров
	|		И ЗаказНаДоставкуОснования.Документ = втПеремещения.ПеремещениеСсылка
	|;	
	|
	|///////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНаПеревозку.Ссылка Как ЗаданиеНаПеревозкуСсылка
	|ИЗ 
	|	Документ.ЗаданиеНаПеревозкуРейс.Основания КАК ЗаданиеНаПеревозкуОснования
	|СОЕДИНЕНИЕ	
	|	Документ.ЗаданиеНаПеревозкуРейс КАК ЗаданиеНаПеревозку
	|	ПО
	|		ЗаданиеНаПеревозкуОснования.Ссылка = ЗаданиеНаПеревозку.Ссылка
	|		И ЗаданиеНаПеревозку.Проведен
	|		И Не ЗаданиеНаПеревозку.ПометкаУдаления
	|СОЕДИНЕНИЕ
	|	втЗаказыНаДоставку 
	|	ПО 
	|		ЗаданиеНаПеревозкуОснования.Документ = втЗаказыНаДоставку.ЗаказНаДоставкуСсылка");

	Запрос.УстановитьПараметр("АктСсылка", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Сообщить("Не найдены документы ""Задание на перевозку (Рейс)"" для пересчета транспортных расходов");	
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаданиеНаПеревозкуОбъект = Выборка.ЗаданиеНаПеревозкуСсылка.ПолучитьОбъект();
			Документы.ЗаданиеНаПеревозкуРейс.СформироватьЗатраты(ЗаданиеНаПеревозкуОбъект, Ложь);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Док_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	УстановитьДоступностьПересчета();
КонецПроцедуры

Процедура УстановитьДоступностьПересчета()
	//Элементы.ПересчитатьТранспортныеРасходы.Доступность = Элементы.ОформитьДокументы.Доступность;
КонецПроцедуры

#КонецОбласти

#Область ОповещениеМенеджераОРасхождениях

&НаСервере
Процедура ПолучитьПредыдущиеРасхождения()
	
	ПредыдущиеРасхождения.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПредыдущиеРасхожденияТЗ = РеквизитФормыВЗначение("ПредыдущиеРасхождения");
		ПредыдущиеРасхожденияТЗ = ПолучитьРасхожденияПоТоварам(Объект.Ссылка).Выгрузить(); 
		ЗначениеВРеквизитФормы(ПредыдущиеРасхожденияТЗ, "ПредыдущиеРасхождения")
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОповеститьМенеджераОРасхождениях()
	
	ПредыдущиеРасхожденияТЗ = РеквизитФормыВЗначение("ПредыдущиеРасхождения");
	РезультатРасхождений = ПолучитьОснованияРасхождений(Объект.Ссылка, ПредыдущиеРасхожденияТЗ);
	
	Если Не РезультатРасхождений.Пустой() Тогда
		
		ВыборкаДокумент = РезультатРасхождений.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДокумент.Следующий() Цикл
			
			ВыборкаОтветственный = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаОтветственный.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаОтветственный.Ответственный) Тогда
				
					Адресат = ВыборкаОтветственный.Ответственный;
					
					ВыборкаНоменклатура = ВыборкаОтветственный.Выбрать();
					СписокТоваров = "";
					Пока ВыборкаНоменклатура.Следующий() Цикл
						Если СписокТоваров <> "" Тогда
							СписокТоваров = СписокТоваров + Символы.ПС;
						КонецЕсли;
						СписокТоваров = СписокТоваров + Символы.Таб + Символы.Таб + ВыборкаНоменклатура.Номенклатура;
					КонецЦикла;
					
					ТекстСообщения = "По документу " + ВыборкаДокумент.ИсходныйДокумент + Символы.ПС 
						+ "поступило не все количество по следующим позициям:" + Символы.ПС
						+ СписокТоваров + "." + Символы.ПС
						+ "Расхождения можно посмотреть:" + Символы.ПС
						+ Объект.Ссылка;
						
					Попытка
						АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТекстСообщения, Адресат);
						ЗаписьЖурналаРегистрации("Оповещение менеджера о расхождениях после перемещения", УровеньЖурналаРегистрации.Информация,,,  Адресат);
					Исключение
						ТекстОшибки = "Оповещение менеджера " + ВыборкаОтветственный.Ответственный + " о расхождениях после перемещения";
						ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка,,,  ОписаниеОшибки());
						ТекстОшибки = "Не удалось оповестить " + ВыборкаОтветственный.Ответственный + " о расхождениях: ";
						Сообщить(ТекстОшибки);
					КонецПопытки;	
				Иначе
					ТекстОшибки = "У документа " + ВыборкаДокумент.ИсходныйДокумент + " не указан ответственный." 
					+ " Оповещение о расхождениях не отправлено";
					Сообщить(ТекстОшибки);						
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасхожденияПоТоварам(АктСсылка) 
	
	Запрос = Новый Запрос (
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктТовары.Номенклатура КАК Номенклатура,		
	|	АктТовары.ДокументОснование Как ПеремещениеСсылка
	|ИЗ 
	|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК АктТовары
	|СОЕДИНЕНИЕ	
	|	Документ.АктОРасхожденияхПослеПеремещения КАК Акт
	|ПО
	|	АктТовары.Ссылка = Акт.Ссылка
	|	И Акт.Проведен
	|	И Не Акт.ПометкаУдаления
	|ГДЕ
	|	Акт.Ссылка = &АктСсылка
	|	И АктТовары.КоличествоУпаковок - АктТовары.КоличествоУпаковокПоДокументу < 0");
	
	Запрос.УстановитьПараметр("АктСсылка", АктСсылка);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьОснованияРасхождений(АктСсылка, ПредыдущиеРасхождения) 
	
	Запрос = Новый Запрос (
    "ВЫБРАТЬ 
	|	ПредыдущиеРасхождения.Номенклатура,
	|	ПредыдущиеРасхождения.ПеремещениеСсылка
	|ПОМЕСТИТЬ
	|	втПредыдущиеРасхождения
	|ИЗ 
	|	&ПредыдущиеРасхождения КАК ПредыдущиеРасхождения
	|;
	|/////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктТовары.Номенклатура КАК Номенклатура,		
	|	АктТовары.ДокументОснование Как ПеремещениеСсылка
	|ПОМЕСТИТЬ втРасхожденияНоменклатуры
	|ИЗ 
	|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК АктТовары
	|СОЕДИНЕНИЕ	
	|	Документ.АктОРасхожденияхПослеПеремещения КАК Акт
	|ПО
	|	АктТовары.Ссылка = Акт.Ссылка
	|	И Акт.Проведен
	|	И Не Акт.ПометкаУдаления
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	втПредыдущиеРасхождения 
	|ПО 
	|	АктТовары.Номенклатура = втПредыдущиеРасхождения.Номенклатура
	|	И АктТовары.ДокументОснование = втПредыдущиеРасхождения.ПеремещениеСсылка
	|ГДЕ
	|	Акт.Ссылка = &АктСсылка
	|	И АктТовары.КоличествоУпаковок - АктТовары.КоличествоУпаковокПоДокументу < 0
	|	И втПредыдущиеРасхождения.Номенклатура ЕСТЬ NULL
	|;
	|/////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Перемещение.Ссылка КАК ПеремещениеСсылка,
	|	Перемещение.Ответственный КАК ПеремещениеОтветственный,
	|	ПеремещениеТовары.Номенклатура,
	|	ПеремещениеТовары.ЗаказНаПеремещение КАК ЗаказСсылка			
	|ПОМЕСТИТЬ втПеремещениеНоменклатуры
	|ИЗ
	|	втРасхожденияНоменклатуры
	|СОЕДИНЕНИЕ
	|	Документ.ПеремещениеТоваров КАК Перемещение 
	|ПО
	|	втРасхожденияНоменклатуры.ПеремещениеСсылка = Перемещение.Ссылка
	|	И Перемещение.Проведен
	|	И НЕ Перемещение.ПометкаУдаления
	|СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТовары
	|ПО 
	|	Перемещение.Ссылка = ПеремещениеТовары.Ссылка
	|	И втРасхожденияНоменклатуры.Номенклатура = ПеремещениеТовары.Номенклатура
	|;
	|/////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ЕСТЬNULL(Заказ.Ссылка, втПеремещениеНоменклатуры.ПеремещениеСсылка) КАК ИсходныйДокумент,
	|	ЕСТЬNULL(Заказ.Ответственный, втПеремещениеНоменклатуры.ПеремещениеОтветственный) КАК Ответственный,
	|	втПеремещениеНоменклатуры.Номенклатура
	|ИЗ 
	|	втПеремещениеНоменклатуры	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ЗаказНаПеремещение КАК Заказ 
	|ПО
	|	втПеремещениеНоменклатуры.ЗаказСсылка = Заказ.Ссылка
	|	И Заказ.Проведен
	|	И НЕ Заказ.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	1, Номенклатура.Наименование
	|ИТОГИ ПО
	|	ЕСТЬNULL(Заказ.Ссылка, втПеремещениеНоменклатуры.ПеремещениеСсылка),
	|	ЕСТЬNULL(Заказ.Ответственный, втПеремещениеНоменклатуры.ПеремещениеОтветственный)");

	Запрос.УстановитьПараметр("АктСсылка", АктСсылка);
	Запрос.УстановитьПараметр("ПредыдущиеРасхождения", ПредыдущиеРасхождения);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции		

&НаКлиенте
&ИзменениеИКонтроль("ПерезаполнитьПоПоступлениюОтветПользователя")
Процедура Док_ПерезаполнитьПоПоступлениюОтветПользователя(РезультатВопроса, ДополнительныеПараметры)

	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	КонецЕсли;
    #Удаление
	Если Объект.Проведен Тогда 
	#КонецУдаления
	#Вставка
	Если НЕ Объект.Ссылка.Пустая() Тогда
	#КонецВставки
		ЗаполнитьПоПриемкеСервер();

		ПоказатьОповещениеПользователя(
		НСтр("ru = 'Количество перезаполнено'"),
		,
		НСтр("ru='В строках перезаполнено количество.'"),
		БиблиотекаКартинок.Информация32);
		
		#Вставка
		ЗаполнитьСуммуРасхождений();
		#КонецВставки
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммуРасхождений()

	ТЧАкта = Новый ТаблицаЗначений;
	ТЧАкта.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТЧАкта.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЧАкта.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЧАкта.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ТЧАкта.Колонки.Добавить("СкладОтправитель", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЧАкта.Колонки.Добавить("КоличествоПоДокументу", Новый ОписаниеТипов("Число"));
	ТЧАкта.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТЧАкта.Колонки.Добавить("Перемещение", Новый ОписаниеТипов("ДокументСсылка.ПеремещениеТоваров"));
	
	Для каждого Строка Из Объект.Товары Цикл
	
		стр = ТЧАкта.Добавить();            
		стр.Номенклатура = Строка.Номенклатура;
		стр.Характеристика = Строка.Характеристика;
		стр.Назначение = Строка.Назначение;
		стр.СкладОтправитель = Объект.СкладОтправитель;
		стр.КоличествоПоДокументу = Строка.КоличествоУпаковокПоДокументу;
		стр.Количество = Строка.КоличествоУпаковок;
		стр.НомерСтроки = Строка.НомерСтроки;
		стр.Перемещение = ДокументыОснования[0].ДокументОснование; 
	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		    "ВЫБРАТЬ
			|	АктОРасхожденияхПослеПеремещенияТовары.НомерСтроки КАК НомерСтроки,
			|	АктОРасхожденияхПослеПеремещенияТовары.Номенклатура КАК Номенклатура,
			|	АктОРасхожденияхПослеПеремещенияТовары.Характеристика КАК Характеристика,
			|	АктОРасхожденияхПослеПеремещенияТовары.Назначение КАК Назначение,
			|	АктОРасхожденияхПослеПеремещенияТовары.СкладОтправитель КАК СкладОтправитель,
			|	АктОРасхожденияхПослеПеремещенияТовары.КоличествоПоДокументу КАК ПоДокументу,
			|	АктОРасхожденияхПослеПеремещенияТовары.Количество КАК Факт,
			|	АктОРасхожденияхПослеПеремещенияТовары.Количество - АктОРасхожденияхПослеПеремещенияТовары.КоличествоПоДокументу КАК Расхождения,
			|	АктОРасхожденияхПослеПеремещенияТовары.Перемещение КАК Перемещение
			|ПОМЕСТИТЬ ВТРасхождения
			|ИЗ
			|	&ТЧАкта КАК АктОРасхожденияхПослеПеремещенияТовары
			|ГДЕ
			|	АктОРасхожденияхПослеПеремещенияТовары.Количество - АктОРасхожденияхПослеПеремещенияТовары.КоличествоПоДокументу <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СебестоимостьТоваров.Регистратор КАК Регистратор,
			|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
			|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
			|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения КАК МестоХранения,
			|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Назначение КАК Назначение,
			|	СУММА(СебестоимостьТоваров.Количество) КАК Количество,
			|	СУММА(СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.ДопРасходы) КАК Сумма
			|ПОМЕСТИТЬ ВТСебестоимостьСПеремещением
			|ИЗ
			|	ВТРасхождения КАК ВТРасхождения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
			|		ПО ВТРасхождения.Перемещение = СебестоимостьТоваров.Регистратор
			|			И ВТРасхождения.Номенклатура = СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура
			|			И ВТРасхождения.СкладОтправитель = СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения
			|			И ВТРасхождения.Назначение = СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Назначение
			|ГДЕ
			|	НЕ СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура ЕСТЬ NULL
			|	И НЕ ВТРасхождения.Номенклатура.Наименование ПОДОБНО ""%н/к%""
			|
			|СГРУППИРОВАТЬ ПО
			|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура,
			|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Характеристика,
			|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения,
			|	СебестоимостьТоваров.Регистратор,
			|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Назначение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТРасхождения.Номенклатура КАК Номенклатура,
			|	ВТРасхождения.Характеристика КАК Характеристика,
			|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.МестоХранения КАК МестоХранения,
			|	СебестоимостьТоваровОстатки.КоличествоОстаток КАК Количество,
			|	СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.ДопРасходыОстаток КАК Сумма,
			|	ВЫБОР
			|		КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток <> 0
			|				И НЕ СебестоимостьТоваровОстатки.КоличествоОстаток ЕСТЬ NULL
			|			ТОГДА (СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.ДопРасходыОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток
			|		ИНАЧЕ СебестоимостьТоваровОстатки.КоличествоОстаток
			|	КОНЕЦ КАК Стоимость
			|ПОМЕСТИТЬ ВТСебестоимостьБезПеремещения
			|ИЗ
			|	ВТРасхождения КАК ВТРасхождения
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСебестоимостьСПеремещением КАК ВТСебестоимостьСПеремещением
			|		ПО ВТРасхождения.Перемещение = ВТСебестоимостьСПеремещением.Регистратор
			|			И ВТРасхождения.Номенклатура = ВТСебестоимостьСПеремещением.Номенклатура
			|			И ВТРасхождения.СкладОтправитель = ВТСебестоимостьСПеремещением.МестоХранения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(&ДатаДокумента, ) КАК СебестоимостьТоваровОстатки
			|		ПО (СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура = ВТРасхождения.Номенклатура)
			|			И (СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика = ВТРасхождения.Характеристика)
			|			И (СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.МестоХранения = ВТРасхождения.СкладОтправитель)
			|ГДЕ
			|	ВТСебестоимостьСПеремещением.Номенклатура ЕСТЬ NULL
			|	И НЕ ВТРасхождения.Номенклатура.Наименование ПОДОБНО ""%н/к%"" 
			|	и СебестоимостьТоваровОстатки.КоличествоОстаток<>0;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЦеныНоменклатурыПоставщиков.Номенклатура КАК Номенклатура,
			|	МАКСИМУМ(ЦеныНоменклатурыПоставщиков.Период) КАК Период
			|ПОМЕСТИТЬ ВТПериодЦенНоменклатуры
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатурыПоставщиков КАК ЦеныНоменклатурыПоставщиков
			|ГДЕ
			|	ЦеныНоменклатурыПоставщиков.Период < &ДатаДокумента
			|	И ЦеныНоменклатурыПоставщиков.Номенклатура В
			|			(ВЫБРАТЬ
			|				ВТРасхождения.Номенклатура
			|			ИЗ
			|				ВТРасхождения КАК ВТРасхождения)
			|	И НЕ ЦеныНоменклатурыПоставщиков.Номенклатура В
			|				(ВЫБРАТЬ
			|					ВТСебестоимостьБезПеремещения.Номенклатура КАК Номенклатура
			|				ИЗ
			|					ВТСебестоимостьБезПеремещения КАК ВТСебестоимостьБезПеремещения
			|				ГДЕ
			|					НЕ ВТСебестоимостьБезПеремещения.Сумма ЕСТЬ NULL
			|		
			|				ОБЪЕДИНИТЬ ВСЕ
			|		
			|				ВЫБРАТЬ
			|					ВТСебестоимостьСПеремещением.Номенклатура
			|				ИЗ
			|					ВТСебестоимостьСПеремещением КАК ВТСебестоимостьСПеремещением
			|				ГДЕ
			|					НЕ ВТСебестоимостьСПеремещением.Сумма ЕСТЬ NULL)
			|	И НЕ ЦеныНоменклатурыПоставщиков.Номенклатура.Наименование ПОДОБНО ""%н/к%""
			|
			|СГРУППИРОВАТЬ ПО
			|	ЦеныНоменклатурыПоставщиков.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЦеныНоменклатурыПоставщиков.Номенклатура КАК Номенклатура,
			|	МАКСИМУМ(ЦеныНоменклатурыПоставщиков.Цена) КАК Цена
			|ПОМЕСТИТЬ ВТЦеныПоставщиков
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатурыПоставщиков КАК ЦеныНоменклатурыПоставщиков
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодЦенНоменклатуры КАК ВТПериодЦенНоменклатуры
			|		ПО (ВТПериодЦенНоменклатуры.Период = ЦеныНоменклатурыПоставщиков.Период)
			|			И (ВТПериодЦенНоменклатуры.Номенклатура = ЦеныНоменклатурыПоставщиков.Номенклатура)
			|ГДЕ
			|	НЕ ЦеныНоменклатурыПоставщиков.Номенклатура В
			|				(ВЫБРАТЬ
			|					ВТСебестоимостьБезПеремещения.Номенклатура КАК Номенклатура
			|				ИЗ
			|					ВТСебестоимостьБезПеремещения КАК ВТСебестоимостьБезПеремещения
			|				ГДЕ
			|					НЕ ВТСебестоимостьБезПеремещения.Сумма ЕСТЬ NULL
			|		
			|				ОБЪЕДИНИТЬ ВСЕ
			|		
			|				ВЫБРАТЬ
			|					ВТСебестоимостьСПеремещением.Номенклатура
			|				ИЗ
			|					ВТСебестоимостьСПеремещением КАК ВТСебестоимостьСПеремещением
			|				ГДЕ
			|					НЕ ВТСебестоимостьСПеремещением.Сумма ЕСТЬ NULL)
			|	И НЕ ЦеныНоменклатурыПоставщиков.Номенклатура.Наименование ПОДОБНО ""%н/к%""
			|
			|СГРУППИРОВАТЬ ПО
			|	ЦеныНоменклатурыПоставщиков.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТРасхождения.Номенклатура КАК Номенклатура,
			|	ВТЦеныПоставщиков.Цена КАК Цена,
			|	ВТРасхождения.Расхождения КАК Количество,
			|	ВЫБОР
			|		КОГДА ВТРасхождения.Расхождения > 0
			|			ТОГДА ВТРасхождения.Расхождения * ВТЦеныПоставщиков.Цена
			|		ИНАЧЕ ВТЦеныПоставщиков.Цена * -1 * ВТРасхождения.Расхождения
			|	КОНЕЦ КАК Сумма
			|ПОМЕСТИТЬ ВТОстатки
			|ИЗ
			|	ВТРасхождения КАК ВТРасхождения
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
			|		ПО ВТРасхождения.Номенклатура = ВТЦеныПоставщиков.Номенклатура
			|ГДЕ
			|	НЕ ВТРасхождения.Номенклатура В
			|				(ВЫБРАТЬ
			|					ВТСебестоимостьБезПеремещения.Номенклатура КАК Номенклатура
			|				ИЗ
			|					ВТСебестоимостьБезПеремещения КАК ВТСебестоимостьБезПеремещения
			|				ГДЕ
			|					НЕ ВТСебестоимостьБезПеремещения.Сумма ЕСТЬ NULL
			|		
			|				ОБЪЕДИНИТЬ ВСЕ
			|		
			|				ВЫБРАТЬ
			|					ВТСебестоимостьСПеремещением.Номенклатура
			|				ИЗ
			|					ВТСебестоимостьСПеремещением КАК ВТСебестоимостьСПеремещением
			|				ГДЕ
			|					НЕ ВТСебестоимостьСПеремещением.Сумма ЕСТЬ NULL)
			|	И НЕ ВТРасхождения.Номенклатура.Наименование ПОДОБНО ""%н/к%""
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТоварыДругогоКачества.Номенклатура КАК КачественнаяНоменклатура,
			|	ВТРасхождения.Номенклатура КАК Номенклатура,
			|	ВТРасхождения.Расхождения КАК Количество,
			|	ВЫБОР
			|		КОГДА НЕ ВТСебестоимостьБезПеремещения.Сумма ЕСТЬ NULL
			|			ТОГДА ВТСебестоимостьБезПеремещения.Сумма / ВТСебестоимостьБезПеремещения.Количество * ВТРасхождения.Расхождения * 0.702
			|		ИНАЧЕ ВЫБОР
			|				КОГДА НЕ ВТСебестоимостьСПеремещением.Сумма ЕСТЬ NULL
			|					ТОГДА ВТСебестоимостьСПеремещением.Сумма / ВТСебестоимостьСПеремещением.Количество * ВТРасхождения.Расхождения * 0.702
			|				ИНАЧЕ ВТОстатки.Сумма / ВТОстатки.Количество * ВТРасхождения.Расхождения * 0.6
			|			КОНЕЦ
			|	КОНЕЦ КАК Сумма
			|ПОМЕСТИТЬ ВТНКНоменклатура
			|ИЗ
			|	ВТРасхождения КАК ВТРасхождения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСебестоимостьСПеремещением КАК ВТСебестоимостьСПеремещением
			|			ПО (ВТСебестоимостьСПеремещением.Номенклатура = ТоварыДругогоКачества.Номенклатура)
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСебестоимостьБезПеремещения КАК ВТСебестоимостьБезПеремещения
			|			ПО (ВТСебестоимостьБезПеремещения.Номенклатура = ТоварыДругогоКачества.Номенклатура)
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
			|			ПО (ВТОстатки.Номенклатура = ТоварыДругогоКачества.Номенклатура)
			|		ПО ВТРасхождения.Номенклатура = ТоварыДругогоКачества.НоменклатураБрак
			|ГДЕ
			|	НЕ ТоварыДругогоКачества.Номенклатура ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТРасхождения.НомерСтроки КАК НомерСтроки,
			|	ВТРасхождения.Номенклатура КАК Номенклатура,
			|	ВТРасхождения.Характеристика КАК Характеристика,
			|	ВТРасхождения.Назначение КАК Назначение,
			|	ВТСебестоимостьСПеремещением.Сумма КАК Сумма,
			|	ВТСебестоимостьСПеремещением.Количество КАК Количество,
			|	ВТРасхождения.Расхождения КАК Расхождения,
			|	ВЫБОР
			|		КОГДА ВТСебестоимостьСПеремещением.Количество <> 0
			|			ТОГДА ВЫБОР
			|					КОГДА ВТРасхождения.Расхождения > 0
			|						ТОГДА ВТСебестоимостьСПеремещением.Сумма * ВТРасхождения.Расхождения / ВТСебестоимостьСПеремещением.Количество
			|					ИНАЧЕ -1 * ВТСебестоимостьСПеремещением.Сумма * ВТРасхождения.Расхождения / ВТСебестоимостьСПеремещением.Количество
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Себестоимость
			|ИЗ
			|	ВТРасхождения КАК ВТРасхождения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСебестоимостьСПеремещением КАК ВТСебестоимостьСПеремещением
			|		ПО ВТРасхождения.Перемещение = ВТСебестоимостьСПеремещением.Регистратор
			|			И ВТРасхождения.Номенклатура = ВТСебестоимостьСПеремещением.Номенклатура
			|			И ВТРасхождения.СкладОтправитель = ВТСебестоимостьСПеремещением.МестоХранения
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТРасхождения.НомерСтроки,
			|	ВТРасхождения.Номенклатура,
			|	ВТРасхождения.Характеристика,
			|	ВТРасхождения.Назначение,
			|	ВТСебестоимостьСПеремещением.Сумма,
			|	ВТСебестоимостьСПеремещением.Количество,
			|	ВТРасхождения.Расхождения
			|
			|ИМЕЮЩИЕ
			|	НЕ ВЫБОР
			|			КОГДА ВТСебестоимостьСПеремещением.Количество <> 0
			|				ТОГДА ВЫБОР
			|						КОГДА ВТРасхождения.Расхождения > 0
			|							ТОГДА ВТСебестоимостьСПеремещением.Сумма * ВТРасхождения.Расхождения / ВТСебестоимостьСПеремещением.Количество
			|						ИНАЧЕ ВТСебестоимостьСПеремещением.Сумма * -1 * ВТРасхождения.Расхождения / ВТСебестоимостьСПеремещением.Количество
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТРасхождения.НомерСтроки,
			|	ВТРасхождения.Номенклатура,
			|	ВТРасхождения.Характеристика,
			|	ВТРасхождения.Назначение,
			|	ВТСебестоимостьБезПеремещения.Сумма,
			|	ВТСебестоимостьБезПеремещения.Количество,
			|	ВТРасхождения.Расхождения,
			|	ВЫБОР
			|		КОГДА ВТРасхождения.Расхождения > 0
			|			ТОГДА ВТСебестоимостьБезПеремещения.Стоимость * ВТРасхождения.Расхождения
			|		ИНАЧЕ ВТСебестоимостьБезПеремещения.Стоимость * -1 * ВТРасхождения.Расхождения
			|	КОНЕЦ
			|ИЗ
			|	ВТРасхождения КАК ВТРасхождения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСебестоимостьБезПеремещения КАК ВТСебестоимостьБезПеремещения
			|		ПО ВТРасхождения.Номенклатура = ВТСебестоимостьБезПеремещения.Номенклатура
			|			И ВТРасхождения.СкладОтправитель = ВТСебестоимостьБезПеремещения.МестоХранения
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТРасхождения.НомерСтроки,
			|	ВТРасхождения.Номенклатура,
			|	ВТРасхождения.Характеристика,
			|	ВТРасхождения.Назначение,
			|	ВТСебестоимостьБезПеремещения.Сумма,
			|	ВТСебестоимостьБезПеремещения.Количество,
			|	ВТРасхождения.Расхождения,
			|	ВТСебестоимостьБезПеремещения.Стоимость
			|
			|ИМЕЮЩИЕ
			|	НЕ ВЫБОР
			|			КОГДА ВТРасхождения.Расхождения > 0
			|				ТОГДА ВТСебестоимостьБезПеремещения.Стоимость * ВТРасхождения.Расхождения
			|			ИНАЧЕ ВТСебестоимостьБезПеремещения.Стоимость * -1 * ВТРасхождения.Расхождения
			|		КОНЕЦ ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТРасхождения.НомерСтроки,
			|	ВТРасхождения.Номенклатура,
			|	ВТРасхождения.Характеристика,
			|	ВТРасхождения.Назначение,
			|	ВТНКНоменклатура.Сумма,
			|	ВТНКНоменклатура.Количество,
			|	ВТРасхождения.Расхождения,
			|	ВТНКНоменклатура.Сумма
			|ИЗ
			|	ВТНКНоменклатура КАК ВТНКНоменклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасхождения КАК ВТРасхождения
			|		ПО ВТНКНоменклатура.Номенклатура = ВТРасхождения.Номенклатура
			|ГДЕ
			|	НЕ ВТНКНоменклатура.Сумма ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТРасхождения.НомерСтроки,
			|	ВТРасхождения.Номенклатура,
			|	ВТРасхождения.Характеристика,
			|	ВТРасхождения.Назначение,
			|	ВТОстатки.Сумма,
			|	ВТОстатки.Количество,
			|	ВТРасхождения.Расхождения,
			|	ВТОстатки.Сумма
			|ИЗ
			|	ВТОстатки КАК ВТОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасхождения КАК ВТРасхождения
			|		ПО ВТОстатки.Номенклатура = ВТРасхождения.Номенклатура
			|ГДЕ
			|	НЕ ВТОстатки.Сумма ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("ТЧАкта", ТЧАкта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПараметрыОтбора = Новый Структура();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			
		СтрокаТЧ = Объект.Товары.НайтиСтроки(Новый Структура("НомерСтроки", ВыборкаДетальныеЗаписи.НомерСтроки)); 
		Если СтрокаТЧ <> Неопределено Тогда 
			СтрокаТЧ[0].СуммаРасхождений = ВыборкаДетальныеЗаписи.Себестоимость;
		КонецЕсли;  
			
	КонецЦикла;
	
	РассчитатьУбыток();

КонецПроцедуры


&НаСервере
Процедура РассчитатьУбыток()

	ИтоговаяСумма = 0;
	СуммаПоВсемРасхождениям = 0;
	Для каждого Строка Из Объект.Товары Цикл
	
		Если Строка.КоличествоУпаковокРасхождения > 0 Тогда
			ИтоговаяСумма = ИтоговаяСумма-Строка.СуммаРасхождений;
			СуммаПоВсемРасхождениям = СуммаПоВсемРасхождениям+Строка.СуммаРасхождений;
		Иначе
			ИтоговаяСумма = ИтоговаяСумма+Строка.СуммаРасхождений;
			СуммаПоВсемРасхождениям = СуммаПоВсемРасхождениям+Строка.СуммаРасхождений;
		КонецЕсли;

	КонецЦикла;
	Убыток = ИтоговаяСумма;
	СуммаПоРасхождениям = СуммаПоВсемРасхождениям;

КонецПроцедуры 

&НаКлиенте
Процедура Док_ПерезаполнитьПоПоступлениюПосле(Команда)
	ЗаполнитьСуммуРасхождений();
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ЯвляетсяРуководителемОтделаКачества()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ                                   
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(ГруппыДоступа.Ссылка) = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЯвляетсяРуководителемОтделаКачества
		|ИЗ
		|	Справочник.ГруппыДоступа КАК ГруппыДоступа
		|ГДЕ
		|	ГруппыДоступа.Ссылка = &ГруппаДоступа
		|	И ГруппыДоступа.Пользователи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("ГруппаДоступа", Справочники.ГруппыДоступа.НайтиПоНаименованию("Руководитель отдела качества"));
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ЯвляетсяРуководителемОтделаКачества;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции // ЯвляетсяРуководителемОтделаКачества()


&НаСервере
Функция СтатусОтработано()
	Возврат Объект.Статус = Перечисления.СтатусыАктаОРасхождениях.Отработано
КонецФункции // СтатусОтработано()

&НаКлиенте
Процедура Док_ПередЗакрытииПеред(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
   ПараметрыЗаписи = Новый Структура();
   ПараметрыЗаписи.Вставить("Закрыть", Истина);
	Если НезаполненыеОтработкиРасхождений() И Модифицированность Тогда
       Отказ = Истина;
       ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
       Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
       ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
       ПараметрыЗаписи = Новый Структура();
       ПараметрыЗаписи.Вставить("Закрыть", Истина);
       Если Записать(ПараметрыЗаписи) Тогда
       		Закрыть();
       КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
       Модифицированность = Ложь;
       Закрыть();
	КонецЕсли;
        
КонецПроцедуры


&НаКлиенте
Процедура Док_ПровестиИЗакрытьВместоПеред(Команда)
	ПараметрыЗаписи = Новый Структура();
    ПараметрыЗаписи.Вставить("РежимЗаписи", ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение"));
    ПараметрыЗаписи.Вставить("Закрыть", Истина);
	
	Если НезаполненыеОтработкиРасхождений() И Записать(ПараметрыЗаписи) Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Док_СтатусПриИзмененииПосле(Элемент)
	Если Не СтатусОтработано() Тогда
		Объект.ОтработанБезРазбора = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НезаполненыеОтработкиРасхождений()
	НетОшибок = Истина;
	Для ТекИндекс = 0 По Объект.Товары.Количество()-1 Цикл
		
		ТекущаяСтрока = Объект.Товары[ТекИндекс];
		Если Объект.Статус <> Перечисления.СтатусыАктаОРасхождениях.НеСогласовано 
			И (ТекущаяСтрока.КоличествоУпаковок - ТекущаяСтрока.КоличествоУпаковокПоДокументу) <> 0 
			И Не ЗначениеЗаполнено(ТекущаяСтрока.Действие) Тогда
			
			ТекстОшибки = НСтр("ru='Не заполнено поле ""Как отражать расхождение"" в строке %НомерСтроки% списка ""Товары""'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", ТекущаяСтрока.НомерСтроки);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", ТекущаяСтрока.НомерСтроки, "Действие"),
				,
				Истина);
			НетОшибок = Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат НетОшибок;
КонецФункции 

&НаКлиенте
Процедура ПроверитьУстановленоОформитьИЕстьНазначениеОтправителя(ПоказыватьОповещение = Ложь, Строка = Неопределено)
	Строка = ?(ЗначениеЗаполнено(Строка), Строка, Элементы.Товары.ТекущиеДанные);
	
	Если Строка <> Неопределено И ДействиеРавноОформить(Строка.Действие) И ЗначениеЗаполнено(Строка.НазначениеОтправителя) Тогда
		
		Если ПоказыватьОповещение Тогда
			ПоказатьПредупреждение(,"Внимание!
			|При оприходовании этого товара необходимо указать ""Назначение отправителя"" в поле ""Назначение""");
		Иначе
			Сообщить("Внимание! При оприходовании товара в строке " + Строка.НомерСтроки + " необходимо указать ""Назначение отправителя"" в поле ""Назначение""");
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДействиеРавноОформить(Действие)
	Возврат Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется;
КонецФункции

&НаКлиенте
&После("ВыборДействияЗавершение")
Процедура Док_ВыборДействияЗавершение(Результат, ДополнительныеПараметры)
	ПроверитьУстановленоОформитьИЕстьНазначениеОтправителя(Истина);
КонецПроцедуры

&НаКлиенте
&После("ИзменитьДействиеВыделенныхСтрокЗавершение")
Процедура Док_ИзменитьДействиеВыделенныхСтрокЗавершение(Результат, ДополнительныеПараметры)
	Для каждого Строка из Объект.Товары Цикл
		СтруктураСтрока = Новый Структура("Действие, НазначениеОтправителя, НомерСтроки");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Строка);
		ПроверитьУстановленоОформитьИЕстьНазначениеОтправителя(Ложь, СтруктураСтрока);
	КонецЦикла;
КонецПроцедуры
